app/controllers/tweets_controller.rb

    def index
        render json: {status: 200, tweets: Tweet.all}
---
SELECT "tweets".* FROM "tweets"

    def create
    tweet = Tweet.new(tweet_params)
    if tweet.save
---
INSERT INTO "tweets" ("title", "content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "where am i"], ["content", "gotta go where I want to go"], ["author", "troy lemons jr"], ["created_at", "2021-02-23 22:03:30.407952"], ["updated_at", "2021-02-23 22:03:30.407952"]]

    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tweets" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "tweets"."id" = $4  [["title", "I'm where Im supposed to be"], ["content", "i go where i want to go"], ["updated_at", "2021-02-23 22:06:49.988452"], ["id", 3]]